turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N2A.atdf
      <value-group caption="" name="PWM_MR__PREB">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
      </value-group>
      <value-group caption="" name="PWM_CMR0__CPRE">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR1__CPRE">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR2__CPRE">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR3__CPRE">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
    </module>
    <module caption="Reset Controller" name="RSTC" version="11009A">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="Peripheral Reset" mask="0x00000004" name="PERRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="External Reset Length" mask="0x00000F00" name="ERSTL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY"/>
        </register>
      </register-group>
    </module>
    <module caption="Real-time Clock" name="RTC" version="6056I">
      <register-group name="RTC">
        <register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Current Second" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" name="AMPM"/>
        </register>
